{
    "HELLO": "Hi there!\nI’m the personal bot of Jafar, a Full Stack Engineer based out of Gurgaon, India.\n![Jafar](http://zillion.io/img/jafar1.jpg)\nWant to know more about his projects or learn about Jafar's technology stack? %[His technology stack](postback:here_for_the_tech_stack) %[His projects](postback:learn_about_jafar_projects) %[Technology thoughts!](postback:technology_quote)",
    "TELL HER": "Let's tweet @ Esther so she knows you're setting a bot up. Here's a tweet that's ready to go: %[Tweet Esther](http://bit.ly/estherbot-tweet)",
    "I LOVE YOU": "Awh, shucks! I love you too!",
    "CONNECT ME": "",
    "DISCONNECT": "Roger that, JafarBot is back.",

    "HIS PROJECTS" : "I am still learning about his vast projects, it will take some time for me to digest all that. \n But i do know about his %[His technology stack](postback:here_for_the_tech_stack)",
    "TECHNOLOGY THOUGHTS!":"System Scalability and User Experience - In the end, thats all that matters. \n This is his belief and the same is reflected in his work %[His technology stack](postback:here_for_the_tech_stack)",
    "HIS TECHNOLOGY STACK" : "Great, Jafar has worked on multiple domains, he can take care of the complete development process.\n Given a problem statement, he can quickly set up a SailsJs(Built on top of Express-Nodejs) server, a native Android application and even a desktop client in Golang or Node Webkit  %[Frontend](postback:frontend) %[Mobile](postback:mobile) %[Backend](postback:backend)",


    "FRONTEND" : "His frontend development majorly comprises of Web 2.0 apps(SPA) which focuses on decoupling client and server.\n He prefers client side rendering and thinks server side rendering is thing of the past and should be used only if clent side rendering does not work. %[AngularJs 1.x](postback:angular)",
    "ANGULARJS 1.X" : "Level : 6/10 \n He has built multiple dashboards for various clients like Rekart, Instspaces, SamasyaHal.\n He loves Restangular and favours gulp over grunt because gulp seems fast to him, maybe he loves writing code required in the gulpfile. \n He has also built a Yeoman generator for scaffolding new Angular Projects https://github.com/naqvijafar91/angularjs-generator . He built that after researching and implementing best practices of Angular 1.x",

    "MOBILE":"He began Programming mobile apps when the smartphone revolution was at its peak. \n Now he believes that IoT is the next big thing. Click below to know more about %[Android](postback:android)",
    "ANDROID": "Level : 9.5/10 \n He started his professional career as an Android Developer. Can do almost anything possible with Android OS \n Developed 6 android applications which are on the play store and he is recently learning about marketing in order to promote an app he built as a hobby project Udhaar Manager https://play.google.com/store/apps/details?id=com.coahingms.canteenaccounts .\n He has also extended Volley, the networking library in order to customize and properly utilize caching in Android apps",

    "BACKEND" :"Jafar likes backend the most, he tries to throw as much processing on the server as possible and is a strong believer of REST. \n He wants that client machines should just have enough power to run a successfull internet connection. \n And so, his broadest skill set - he has worked on Express,SailsJs,PHP,Codeigniter,JSP/Servlets, Go Programming Language and MySql and MongoDb for database %[NodeJs/Express](postback:node_express) %[NodeJs/SailsJs](postback:node_sails) %[JSP/Servlets](postback:jsp_Servlets)",
    "NODEJS/EXPRESS" : " Level 8.5/10 \n He started working on express after getting pissed by writing a lot of unnecessary code required in JSP/Servlets \n Since then he has successfully built around 6 backends for various Web as well as Android applications. \n He recommends anyone using Express to follow best practices or the code would become un-managable. \n He uses regular expressions in his routes and heavily relies on Mongoose Hooks for handling things at the database layer itself.\n Udhaar Manager's backend is also built using express along with socket.io as a major library",
    "NODEJS/SAILSJS" : " Level 7.5/10 \n He heard about sails in the nodejs weekly newsletter, and since then there has been no looking back. \n Transition from Mongoose to Waterline was a breeze, along with Bluebird.js - A promises library. Built around 7 backends in Sails for professional as well as personal projects. Can build a Dashboard coupled with AngularJs within 3 days",
    "JSP/SERVLETS" : " Level 7/10 \n He has built a realtime video recommendation engine using Servlets and MySql for an Android app which he built called Whizkidz. \n He knows that using Servlets is time consuming but its reliable and resource efficient. \n He can build CRON jobs using Quartz library and even build REST APIS using plain Servlets- Ofcourse it will take much more time as compared to SailsJs"
}
